jQuery(function ($) {
  /**
   *
   *
   * Qoutes
   *
   *
   */
  const greetings = [
    "منتظرت بودم :)",
    "قلم‌ انتظارت رو می‌کشید!",
    "نذار هیچ کاغذی سفید بمونه!",
    "کتاب‌ها رو کسانی مثل تو خلق می‌کنن!",
    "خوشحالم که می‌بینمت دوباره :)",
    "دستت رو با ذهنت پیوند بده!",
    "قلم رو به رقص در بیار",
    "هربار که برمی‌گردی یه جون اضافه می‌گیرم!",
    "با نوشتن می‌تونی یه خالق باشی ، یه خدا!",
    "با هربار برگشتنت به من زندگی می‌بخشی!",
    "امروز قرار دنیای جدیدی خلق کنی؟",
    "خاطرات نوشته‌های بزرگی به حساب می‌آن!",
  ];

  const subjects = [
    `هرمس ، سگ باوفا`,
    `کارگر بیچاره‌ای که در میدان اصلی شهر در دام سقراط می‌افتاد`,
    `گل‌های اطلسی رنگ باخته`,
    `فوران مغزی دارم همین الان باید بنویسم`,
    `آن دو دانشمند پیامی از فراسوی زمان دریافت کردند...`,
    `شعری زیبا ،‌برای خودم`,
    `فریه استارک ، جهان‌گردی کنجکاو یا ماموری به دنبال حقیقت؟`,
    `قانون گرانش نیوتن و انقلابی در فلسفه`,
    `هیلده کیست؟`,
    `آنگاه که نور بی‌کران`,
    `کل قضیه بو دار است...`,
    `شاه گوش می‌کند`,
    `پیش از آن‌ که بگویی سلام`,
    `عشق دور از خانه`,
    `سرهنگ در کتاب‌خانه`,
    `یخ‌بندان`,
    `ماجرای یک شاعر`,
    `مردی که داد زد ترزا`,
    `ایگنیشس در خیابان سن ژوزف چه می‌خواست؟`,
    `دود سیگار جونز همیشه مانند یک ابر کومولوس در فضای کافه می‌پیچید`,
    `رابطه‌ی آقای گونزالز و خانم تریکسی`,
    `بیچارگی های زندگی خانم رایلی`,
    `اندیشه‌هایی در باب مسائل مختلف`,
    `امروز روز خوبی بود`,
    `عینک جونز`,
    `من کی هستم؟`,
    `از کجا آمده ام؟`,
    `خیام خیام خیام`,
    `انا الحق؟`,
    `ترزا پاسخ می‌دهد.`,
    `شک`,
    `دستور پخت یک شیرینی خوش‌مزه ، برای ایگنیشس`,
    `آن وقت بود که آونگ را دیدم`,
  ];

  const buttons = [`دست به قلم شو`, `پس شروع کنیم`, `بریم پیاده روی`];

  const qoutes = [
    [
      `ما می نویسیم تا زندگی را دو بار ، در لحظه و با نگاه به گذشته بچشیم.`,
      `Anaïs Nin`,
    ],
    [
      `اگر وقت خواندن ندارید ، وقت (یا ابزار) نوشتن هم ندارید. به همین سادگی. `,
      `Stephen King`
    ],
    [
      `شما باید کتابی را که می خواهد نوشته شود ، بنویسید. و اگر کتاب برای بزرگسالان بسیار دشوار است ، پس شما آن را برای کودکان می نویسید. `,
      `Madeleine L'Engle`
    ],
    [
      `اگر کتابی هست که می‌خواید بخوانید اما هنوز نوشته نشده ، پس باید آن‌را بنویسید!`,
      `Toni Morrison`
    ],
    [
      `یا چیزی بنویسید که ارزش خواندن داشته باشد یا کاری را که ارزش نوشتن داشته باشد انجام دهید. `,
      `Benjamin Franklin`
    ],
    [
      `برای نوشتن هرگز لازم نیست چیزی که نیمه‌شب بیدارتان کرده را تغییر دهید.`,
      `Saul Bellow`
    ],
    [
      `شما باید از نوشتن مست باشید تا واقعیت نتواند شما را نابود کند. `,
      `Ray Bradbury`
    ],
    [
      `اگر از کلمات به درستی استفاده کنید ، کلمات می توانند مانند اشعه ایکس باشند - از هر چیزی عبور می کنند. می خوانید و سوراخ می شوید.`,
      `Aldous Huxley`
    ],
    [
      `چقدر بیهوده است که وقتی برای زندگی قیام نکرده ای بنشینی و بنویسی. `,
      `Henry David Thoreau`
    ],
    [
      `وقتی می نویسم می توانم همه چیز را کنار بزنم. غمهایم ناپدید می شوند ، شجاعت من دوباره متولد می شود. `,
      `Anne Frank`
    ],
    [
      `نویسنده کسی است که نوشتن برای او ، دشوار تر از دیگران است.`,
      `Thomas Mann`
    ],
    [
      `من همیشه دو کتاب در جیب خود داشتم ، یکی برای خواندن ، یکی برای نوشتن. `,
      `Robert Louis Stevenson`
    ],
    [
      `با نوشتن می توانید هر چیزی را بسازید. `,
      `C.S. Lewis`
    ],
    [
      `اشک کلماتی است که باید نوشته شود. `,
      `Paulo Coelho`
    ],
    [
      `برای زنده ماندن باید داستان بگویید. `,
      `Umberto Eco`
    ],
    [
      `همیشه شاعر باشید ، حتی در نثر. `,
      `Charles Baudelaire`
    ],
    [
      `اگر دکترم به من می‌گفت که فقط شش دقیقه برای زندگی فرصت دارم ، به فکر فرو نمی‌رفتم بلکه سریع‌تر تایپ می‌کردم.`,
      `Isaac Asimov`
    ],
    [
      `هدف نویسنده این است که تمدن از بین نرود. `,
      `Albert Camus`
    ],
    [
      `من می‌نویسم تا آنچه را که می‌دانم کشف کنم.`,
      `Flannery O'Connor`
    ],
    [
      `به عنوان یک نویسنده ، نباید قضاوت کنید ، باید درک کنید. `,
      `Ernest Hemingway`
    ],
    [
      `ارزشمندترین استعدادها این است که هرگز از دو کلمه استفاده نکنید زمانی که یکی کار می‌کند!`,
      `Thomas Jefferson`
    ],
    [
      `نویسندگان دو بار زندگی می کنند. `,
      `Natalie Goldberg`
    ],
    [
      `برای تولید یک کتاب توانا ، شما باید یک موضوع قدرتمند را انتخاب کنید.`,
      `Herman Melville`
    ],
    [
      `کلمات عدسی‌هایی برای تمرکز ذهن فرد هستند. `,
      `Ayn Rand`
    ],
    [
      `نوشتن پاداش خودش است. `,
      `Henry Miller`
    ],
    [
      `یک کاغذ خالی راهی است که خداوند به ما می گوید خدا بودن سخت است. `,
      `Sidney Sheldon`
    ],
    [
      `وقتی موسیقی می سازید یا می نویسید یا خلق می کنید ، واقعاً وظیفه شما این است که با هر ایده ای که در آن زمان می نویسید ، رابطه جنسی مغزدار ، غیرمسئول و بدون کاندوم داشته باشید. `,
      `Lady Gaga`
    ]
  ];

  /**
   *
   *
   *
   * Print Data
   *
   *
   *
   */
  const randomNum = (array) => {
    min = 0;
    max = array.length - 1;

    min = Math.ceil(min);
    max = Math.floor(max);
    return Math.floor(Math.random() * (max - min + 1)) + min;
  };

  $(document).ready(function () {
    // Set random greeting
    $(".greeting").html(greetings[randomNum(greetings)]);

    // Set random subject place holder
    $(".subject").attr("placeholder", subjects[randomNum(subjects)]);

    // Set button value
    $(".button").html(buttons[randomNum(buttons)]);

    // Set qoutes
    const the_qoute = qoutes[randomNum(qoutes)];
    $(".qoute").html(the_qoute[0]);
    $(".source").html(the_qoute[1]);
  });
});